## Plan Result (sbox_frontdoor)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 100 to add, 0 to change, 100 to destroy.</code></pre>

* Create
  * module.premium_front_door.azapi_update_resource.frontdoor_system_identity
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;netbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;portal-sbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;portal-sbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;portal-sbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_D[&#34;netbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_endpoint.endpoint
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;portal-sbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.defaultBackend_origin
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;portal-sbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin_redirect[&#34;netbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.defaultBackend
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;portal-sbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group_redirect[&#34;netbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_profile.front_door
  * module.premium_front_door.azurerm_cdn_frontdoor_route.default_routing_rule
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;portal-sbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;portal-sbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_D[&#34;netbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.https_redirect_rules
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.redirect_hostname[&#34;netbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.https_redirect
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.redirect_hostname_rule_set[&#34;netbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;portal-sbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
  * module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0]
* Delete
  * module.premium_front_door[0].azapi_update_resource.frontdoor_system_identity
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;netbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;portal-sbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;portal-sbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;portal-sbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_custom_domain_association.custom_association_D[&#34;netbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_endpoint.endpoint
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;portal-sbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_firewall_policy.custom[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.defaultBackend_origin
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;portal-sbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin.front_door_origin_redirect[&#34;netbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.defaultBackend
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;portal-sbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_origin_group.origin_group_redirect[&#34;netbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_profile.front_door
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.default_routing_rule
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;portal-sbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;portal-sbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_B[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_route.routing_rule_D[&#34;netbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_rule.https_redirect_rules
  * module.premium_front_door[0].azurerm_cdn_frontdoor_rule.redirect_hostname[&#34;netbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_rule_set.https_redirect
  * module.premium_front_door[0].azurerm_cdn_frontdoor_rule_set.redirect_hostname_rule_set[&#34;netbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;darts-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;pip-frontend&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;portal-sbox&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;pre-portal&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;toffee&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-admin-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-test-web&#34;]
  * module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy[&#34;vh-video-web&#34;]
  * module.premium_front_door[0].azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0]
  * module.premium_front_door[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
  * module.premium_front_door[0].azurerm_monitor_diagnostic_setting.frontdoor_diagnostics
  * module.premium_front_door[0].azurerm_role_assignment.frontdoor_premium_kv_access[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azapi_update_resource.frontdoor_system_identity will be created
  + resource "azapi_update_resource" "frontdoor_system_identity" {
      + body                    = jsonencode(
            {
              + identity = {
                  + type = "SystemAssigned"
                }
            }
        )
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = (known after apply)
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + response_export_values  = [
          + "identity.principalId",
          + "identity.tenantId",
        ]
      + type                    = "Microsoft.Cdn/profiles@2023-02-01-preview"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["darts-portal"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "darts-portal.sandbox.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "darts-portal"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["netbox"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "netbox.sandbox.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "netbox"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["pip-frontend"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "pip-frontend.sandbox.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "pip-frontend"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["portal-sbox"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "portal-sbox.pre-recorded-evidence.justice.gov.uk"
      + id                       = (known after apply)
      + name                     = "portal-sbox"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["pre-portal"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "pre-portal.sandbox.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "pre-portal"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "sds-api-mgmt.sandbox.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "sds-api-mgmt"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "toffee.sandbox.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "toffee"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "vh-admin-web.sandbox.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "vh-admin-web"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["vh-test-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "vh-test-web.sandbox.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "vh-test-web"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["vh-video-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "vh-video-web.sandbox.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "vh-video-web"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["darts-portal"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["pip-frontend"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["portal-sbox"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["pre-portal"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["vh-test-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["vh-video-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["darts-portal"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["pip-frontend"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["portal-sbox"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["pre-portal"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["vh-test-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["vh-video-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_D["netbox"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_D" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_endpoint.endpoint will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "endpoint" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "sdshmcts-sbox"
      + tags                     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["darts-portal"] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + mode                  = "Prevention"
      + name                  = "dartsportalsboxPremium"
      + resource_group_name   = "lz-sbox-rg"
      + sku_name              = "Premium_AzureFrontDoor"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }

      + managed_rule {
          + action  = "Block"
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
          + exclusion {
              + match_variable = "RequestBodyPostArgNames"
              + operator       = "Equals"
              + selector       = "error_description"
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "connect.sid"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["pip-frontend"] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + mode                  = "Prevention"
      + name                  = "pipfrontendsboxPremium"
      + redirect_url          = "https://pip-frontend.sandbox.platform.hmcts.net/unprocessed-request"
      + resource_group_name   = "lz-sbox-rg"
      + sku_name              = "Premium_AzureFrontDoor"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }

      + custom_rule {
          + action                         = "Redirect"
          + enabled                        = true
          + name                           = "ManualUploadPathTraversalGeneral"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "../",
                  + "..\\",
                ]
              + match_variable     = "RequestBody"
              + negation_condition = false
              + operator           = "Contains"
              + transforms         = [
                  + "UrlDecode",
                ]
            }
          + match_condition {
              + match_values       = [
                  + "/manual-upload",
                ]
              

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

s not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox" -> null
      - id                       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/securityPolicies/dartsportalsboxPremium-securityPolicy" -> null
      - name                     = "dartsportalsboxPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/dartsportalsboxPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/customDomains/darts-portal" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["pip-frontend"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox" -> null
      - id                       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/securityPolicies/pipfrontendsboxPremium-securityPolicy" -> null
      - name                     = "pipfrontendsboxPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/pipfrontendsboxPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/customDomains/pip-frontend" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["portal-sbox"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox" -> null
      - id                       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/securityPolicies/portalsboxsboxPremium-securityPolicy" -> null
      - name                     = "portalsboxsboxPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/portalsboxsboxPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/customDomains/portal-sbox" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["pre-portal"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox" -> null
      - id                       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/securityPolicies/preportalsboxPremium-securityPolicy" -> null
      - name                     = "preportalsboxPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/preportalsboxPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/customDomains/pre-portal" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["sds-api-mgmt"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox" -> null
      - id                       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/securityPolicies/sdsapimgmtsboxPremium-securityPolicy" -> null
      - name                     = "sdsapimgmtsboxPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/sdsapimgmtsboxPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/customDomains/sds-api-mgmt" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["toffee"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox" -> null
      - id                       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/securityPolicies/toffeesboxPremium-securityPolicy" -> null
      - name                     = "toffeesboxPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/toffeesboxPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/customDomains/toffee" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["vh-admin-web"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox" -> null
      - id                       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/securityPolicies/vhadminwebsboxPremium-securityPolicy" -> null
      - name                     = "vhadminwebsboxPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhadminwebsboxPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/customDomains/vh-admin-web" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["vh-test-web"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox" -> null
      - id                       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/securityPolicies/vhtestwebsboxPremium-securityPolicy" -> null
      - name                     = "vhtestwebsboxPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhtestwebsboxPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/customDomains/vh-test-web" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_cdn_frontdoor_security_policy.security_policy["vh-video-web"] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      - cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox" -> null
      - id                       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/securityPolicies/vhvideowebsboxPremium-securityPolicy" -> null
      - name                     = "vhvideowebsboxPremium-securityPolicy" -> null

      - security_policies {
          - firewall {
              - cdn_frontdoor_firewall_policy_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhvideowebsboxPremium" -> null

              - association {
                  - patterns_to_match = [
                      - "/*",
                    ] -> null

                  - domain {
                      - active                  = true -> null
                      - cdn_frontdoor_domain_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/customDomains/vh-video-web" -> null
                    }
                }
            }
        }
    }

  # module.premium_front_door[0].azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_key_vault_access_policy" "frontdoor_premium_kv_access" {
      - certificate_permissions = [
          - "Get",
          - "List",
        ] -> null
      - id                      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedtssdssbox/objectId/1abcd94c-f316-4ff1-be82-ef52567817c5" -> null
      - key_permissions         = [
          - "Get",
          - "List",
        ] -> null
      - key_vault_id            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedtssdssbox" -> null
      - object_id               = "1abcd94c-f316-4ff1-be82-ef52567817c5" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.premium_front_door[0].azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
      - id                 = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox|fd-log-analytics-logs-sa" -> null
      - name               = "fd-log-analytics-logs-sa" -> null
      - storage_account_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Storage/storageAccounts/hmctssdsdiagsbox" -> null
      - target_resource_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox" -> null

      - enabled_log {
          - category = "FrontdoorAccessLog" -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - log {
          - category = "FrontDoorHealthProbeLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "FrontDoorWebApplicationFirewallLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.premium_front_door[0].azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
      - id                         = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox|fd-log-analytics" -> null
      - log_analytics_workspace_id = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox" -> null
      - name                       = "fd-log-analytics" -> null
      - target_resource_id         = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox" -> null

      - enabled_log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - log {
          - category = "FrontDoorAccessLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "FrontDoorHealthProbeLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.premium_front_door[0].azurerm_role_assignment.frontdoor_premium_kv_access[0] will be destroyed
  # (because module.premium_front_door[0] is not in configuration)
  - resource "azurerm_role_assignment" "frontdoor_premium_kv_access" {
      - id                   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedtssdssbox/providers/Microsoft.Authorization/roleAssignments/ffa7879e-e1ba-4d20-bd16-a92c84a8fee4" -> null
      - name                 = "ffa7879e-e1ba-4d20-bd16-a92c84a8fee4" -> null
      - principal_id         = "1abcd94c-f316-4ff1-be82-ef52567817c5" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> null
      - role_definition_name = "Key Vault Secrets User" -> null
      - scope                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedtssdssbox" -> null
    }

Plan: 100 to add, 0 to change, 100 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":611,"Program":"tfcmt","SHA1":"","Target":"sbox_frontdoor","Vars":{}} -->